{
    "title": "Front-end Developer",
    "menu1": "About",
    "menu2": "Projects",
    "menu3": "Skills",
    "menu4": "Contact",
    "profilePict": "Photo of Thomas Crouvizier",
    "profilJobSearch": "Front-end developer available immediately, curious, meticulous, and ready to commit to a new project in Nouvelle-Aquitaine or Occitanie.",
    "about": "About Me",
    "about1": "I am an <strong>organized</strong> and <strong>logical</strong> person, passionate about everything related to structure and thinking, like mathematics or coding. For me, developing is not just a job; it's a real pleasure. I see it as a unique blend of logic, creativity, and organization, somewhat like solving a puzzle or playing a video game.",
    "about2": "Since middle school, I have been fascinated by the Internet and the digital world. I always knew I wanted to evolve in this field. What I particularly appreciate is the <strong>creative</strong> aspect of development: imagining an interface that the user will find both <strong>practical</strong>, <strong>pleasant</strong>, and <strong>aesthetic</strong> is a real source of satisfaction for me.",
    "about3": "Naturally, I turned to studies in development before joining the professional world in a <strong>web agency</strong>.",
    "myProjects": "My Projects",
    "myjourney": "My Journey",
    "myjourney1": "After a <strong>BTS SIO</strong>, I obtained in 2019 a <strong>professional bachelor's degree</strong> in 'Web Application and Big Data Development' in Limoges. This final year was carried out in a <strong>work-study</strong> program at Emakina, a web agency also based in Limoges, which gave me the opportunity to try front-end development, despite an initially back-end-oriented training.",
    "myjourney2": "This challenge was a revelation: I quickly found my footing, which allowed me to continue the adventure at Emakina as a front-end developer for <strong>five years</strong>. During this period, I worked on a wide variety of projects, both <strong>showcase and e-commerce</strong> sites, which I detail on the <a href='./projets.html' data-i18n-title='my-projects' title='My Projects'>dedicated page of my achievements</a>. I evolved within <strong>agile teams</strong>, with a constant demand for technical and visual quality.",
    "mygoals": "My Goals",
    "mygoals1": "Currently based near Bordeaux, I am <strong>available immediately</strong> for a position in Nouvelle-Aquitaine or Occitanie. I can quickly adapt to a new opportunity.",
    "mygoals2": "Today, I wish to join a team where I can continue to evolve in front-end development while strengthening my skills, particularly on JavaScript frameworks like Vue.js or React.",
    "mygoals3": "I am also very curious about new practices related to <strong>artificial intelligence</strong>, which I consider a <strong>major asset</strong> for our profession, both to improve our productivity and to explore new ways of designing and developing projects. What I am looking for above all is a <strong>stimulating environment</strong>, where I can learn, exchange, and contribute to concrete and varied projects.",
    "contactTitle": "Thomas Crouvizier Portfolio | Contact",
    "contactTitleH": "Contact Me",
    "contactTitleLink": "Contact me by email",
    "linkedinLink": "Access LinkedIn profile",
    "contactMail": "To contact me by email:",
    "contactOthers": "Other means:",
    "dlCvTitle": "Download my CV:",
    "dlCvTitleLink": "Download my CV",
    "dlCvButton": "📄 Download my CV",
    "skillsTitle": "Thomas Crouvizier Portfolio | Skills",
    "skillsTitleH": "My Skills",
    "skillsEntry1": "Technical Skills",
    "skillsEntry2": "CMS Used",
    "skillsEntry3": "Soft Skills",
    "skillsEntry4": "Project Management",
    "skillsEntry5": "Certifications",
    "skillsAbilityPerso1": "Communication",
    "skillsAbilityPerso2": "Autonomy",
    "skillsAbilityPerso3": "Team Spirit",
    "skillsAbilityPerso4": "Adaptability",
    "skillsAbilityPerso5": "Logical Approach",
    "skillsAbilityPerso6": "Organization",
    "skillsAbilityProject1": "Agile / Scrum",
    "skillsAbilityProject2": "Task Management with Jira",
    "skillsAbilityProject3": "Deadline and Priority Tracking",
    "skillsAbilityProject4": "User Experience",
    "skillsAbilityProject5": "Technical Documentation",
    "projectsTitle": "Thomas Crouvizier Portfolio | Projects",
    "projectsTitleH": "Build Projects",
    "projectsTitleH2": "Support Interaction",
    "followLink": "View the site",
    "close": "Close",
    "knowMore": "Learn more",
    "followLinkArchiv": "View the archived version",
    "projectsDescampsDetail": "Project Details: Descamps",
    "projectsDescampsPeople": "Team: 3 back-end, 3 front-end developers",
    "projectsDescampsTime": "Duration: 5 months",
    "projectsDescampsActivity": "Work done: Various content blocks, email template, back-office administration",
    "projectsDescamps1": "This is the first project I was integrated into when I joined the company for my work-study program. It allowed me to get hands-on with front-end development by working on various small tasks, as well as an introduction to creating email templates.",
    "projectsDescamps2": "A challenge was set for me: to reach a sufficient level in front-end before the end of the project (about 4 months) so I could be assigned to other projects as a front-end developer. Otherwise, I would return to back-end development as originally planned. This challenge was successfully met.",
    "projectsDescamps3": "This project also provided an opportunity to learn about the internal workings of the company: agile methods with Jira, versioning management with Git, preparation for and participation in client demos.",
    "projectsDescampsLink": "Link to the Descamps website",
    "projectsAgnesbDetail": "Project Details: Agnes B",
    "projectsAgnesbPeople": "Team: 2 back-end, 4 front-end developers",
    "projectsAgnesbTime": "Duration: 5 months",
    "projectsAgnesbActivity": "Work done: Various content blocks, PLP, PDP, email template, back-office administration",
    "projectsAgnesb1": "This second project allowed me to enhance my skills with more complex tasks, such as implementing cartridges on product listing pages (PLP) and creating detailed product pages (PDP). I deepened my knowledge of front-end development while discovering and becoming familiar with the Proximis CMS.",
    "projectsAgnesb2": "This is a project that accompanied me over the long term: after the initial development phase, we continued to maintain it. I regularly made occasional changes to it over the years.",
    "projectsAgnesbLink": "Link to the Agnes.B website",
    "projectsDugasDetail": "Project Details: dugasclubexpert",
    "projectsDugasPeople": "Team: 3 back-end, 3 front-end developers",
    "projectsDugasTime": "Duration: 6 months",
    "projectsDugasActivity": "Work done: Various content blocks, footer, header, PDP, selective PLPs, back-office administration",
    "projectsDugas1": "This last project of my work-study program was a continuation of the previous one (Agnès b.), with one significant difference: this time I was fully considered as a front-end developer, no longer as an assistant.",
    "projectsDugas2": "I was given more freedom and autonomy, which allowed me to contribute my ideas, especially on certain choices related to user experience. I also had a more direct impact in interactions with the client.",
    "projectsDugas3": "Unfortunately, for unknown reasons, the site was closed early this year. However, I made an archive of the online version from last year available to show a preview.",
    "projectsDugasLink": "Link to the Dugasclubexpert website",
    "projectsAurepDetail": "Project Details: Aurep",
    "projectsAurepPeople": "Team: 3 back-end, 2 front-end developers",
    "projectsAurepTime": "Duration: 3 months",
    "projectsAurepActivity": "Work done: Various content blocks, article template, back-office administration",
    "projectsAurep1": "This was my first project after completing my work-study program, created with Drupal. I had already had some experience working with this CMS, mainly on support tasks for various projects, but it was the first time I participated in a project from its very beginning.",
    "projectsAurep2": "I was involved from the stage of reviewing the mockups with the designer to evaluate the technical feasibility of the project. It was a purely informational site, with no e-commerce functionality, and a smaller budget compared to the projects I had worked on before. This made it a different experience, with specific needs and an approach suited to the project’s constraints.",
    "projectsAurepLink": "Link to the Aurep website",
    "projectsGuinotDetail": "Project Details: Guinot",
    "projectsGuinotPeople": "Team: 2 back-end, 3 front-end developers",
    "projectGuinotTime": "Duration: 7 months",
    "projectsGuinotActivity": "Work done: Various content blocks, product slider, geolocation search tool, 'My Account' section, back-office administration",
    "projectsGuinot1": "This project marked my first experience with Sylius at Emakina. I was excited to be assigned to it, as it was a real challenge: no team member had worked with this CMS before, so we had to learn everything as we developed.",
    "projectsGuinot2": "In addition to Sylius, we used Contentful for page management, which was another new tool to learn. The client-side reference being a former developer brought a unique dynamic: the exchanges were smoother and more technical, which greatly facilitated collaboration.",
    "projectsGuinot3": "For my part, in addition to various tasks such as integrating product lists (especially on the homepage) and content blocks, I was particularly involved in the geolocation part for institutes. This was a major project for me, as I was discovering the Google Maps API and had to handle all the specific needs of the client for this feature, which was a key element of the site.",
    "projectsGuinot4": "The project was a success: nearly three years after its launch, the site has remained almost unchanged, proving its stability and quality.",
    "projectsGuinotLink": "Link to the Guinot website",
    "projectsKidsaroundDetail": "Project Details: Kids Around",
    "projectsKidsaroundPeople": "Team: 3 back-end, 2 front-end developers",
    "projectsKidsaroundTime": "Duration: 6 months",
    "projectsKidsaroundActivity": "Work done: Various content blocks, cart, header menu, footer, back-office administration",
    "projectsKidsaround1": "This last project at Emakina had a particularity: it involved another CMS switch, this time using Salesforce. In the front-end team, we were three, but I was the only one who had been given a few weeks to self-train beforehand.",
    "projectsKidsaround2": "I started by studying the documentation and practicing on a sandbox, then I strengthened my knowledge by providing support on another Salesforce-based project (the Courir website). This training phase later allowed me to assist my colleagues and share my Salesforce knowledge with them during the development phase.",
    "projectsKidsaround3": "This project was very enriching as it allowed me to take on a lead front-end role, with more responsibilities and a real technical and human involvement in the success of the project.",
    "projectsKidsaroundLink": "Link to the Kids Around website",
    "projectsCamillacDetail": "Project Details: Le Tertre Camillac",
    "projectsCamillacPeople": "Team: solo",
    "projectsCamillacTime": "Duration: 2 days",
    "projectsCamillacActivity": "Work done: Entire site and back-office administration",
    "projectsCamillac1": "A project done outside Emakina, during my job search period, for a small vineyard in Blaye. I had very little experience with WordPress up until then, having only worked with it during technical tests in interviews.",
    "projectsCamillac2": "This was therefore my first concrete project with this CMS. Although modest, this project was very formative for me, and the result fully satisfied the client. A great experience, both technical and human.",
    "projectsCamillacLink": "Link to the Tertre Camillac website",
    "projectsNike1": "This internal Nike project, developed exclusively for a mobile format, marked my first steps with Vue.js. Although I only worked on small adjustments, it was a very enriching first experience.",
    "projectsNike2": "At the time, I had no knowledge of Vue.js, but this project allowed me to discover a modern and powerful tool, which I came to appreciate, even though it was unfortunately not widely used at Emakina.",
    "projectsNike3": "Since this is an internal Nike project, I cannot share screenshots or provide a link to an online version.",
    "projectsExpanscience1": "This was one of my first support projects, which allowed me to train in Drupal and discover how technical support works. I worked on various tasks, from creating new blocks to redesigning elements like the homepage.",
    "projectsExpanscience2": "This project was already in the support phase when I joined and remained there throughout my engagement. It was a very formative experience, giving me a good overview of the challenges and requirements of long-term support.",
    "projectsExpanscienceLink": "Link to the Expanscience website",
    "projectsATPS1": "This project was initially managed by a back-end developer at Emakina, who had some front-end knowledge but often called on me for more complex front-end tasks. I particularly worked on the redesign of the homepage.",
    "projectsATPS2": "The project used Angular, which allowed me to build my first foundations with this framework. I was able to progress in this discovery with the help of my colleague, who had experience with Angular.",
    "projectsATPSLink": "Link to the ATPS website",
    "projectsCourir1": "On this project, I initially supported the existing team, both to help and to self-train, before moving on to another project where I was the only front-end developer trained on Salesforce, with the mission of sharing my knowledge with the team.",
    "projectsCourir2": "On Courir, my tasks were mainly focused on technical support, particularly managing the back-office, as well as some small front-end tasks, which allowed me to get familiar with the file hierarchy and specifics of this type of project.",
    "projectsCourirLink": "Link to the Courir website",
    "projectsOrange1": "This support project was one of the most time-consuming for me, as the clients were very active but often poorly trained in managing their site. Many requests involved simple tasks they could have done themselves.",
    "projectsOrange2": "I took the initiative to train the clients by showing them how to make these changes. I performed the tasks in screen-sharing sessions with them and provided detailed documentation so that they could make these changes independently in the future.",
    "projectsOrangeLink": "Link to the Orange Réseau website",
    "footerCreateBy": "Created by Thomas Crouvizier"
}
