{
    "title": "Développeur Front-end",
    "menu1": "Présentation",
    "menu2": "Projets",
    "menu3": "Compétences",
    "menu4": "Contact",
    "profilePict": "Photo de Thomas Crouvizier",
    "profilJobSearch": "Développeur front-end disponible immédiatement, curieux, rigoureux, et prêt à m’investir dans un nouveau projet en Nouvelle-Aquitaine ou Occitanie.",
    "about": "À propos de moi",
    "about1": "Je suis quelqu’un d’<strong>organisé</strong>, de <strong>logique</strong>, et passionné par tout ce qui touche à la structure et à la réflexion, comme les mathématiques ou le code. Pour moi, développer n’est pas simplement un travail, c’est un vrai plaisir. J’y vois un mélange unique de logique, de créativité et d’organisation, un peu comme résoudre une énigme ou jouer à un jeu vidéo.",
    "about2": "Depuis le collège, je suis fasciné par Internet et le monde du numérique. J’ai toujours su que je voulais évoluer dans ce domaine. Ce que j’apprécie particulièrement, c’est l’aspect <strong>créatif</strong> du développement : imaginer une interface que l’utilisateur va trouver à la fois <strong>pratique</strong>, <strong>agréable</strong> et <strong>esthétique</strong> est une vraie source de satisfaction pour moi.",
    "about3": "C’est donc tout naturellement que je me suis orienté vers des études en développement, avant de rejoindre le monde professionnel dans une <strong>agence web</strong>.",
    "myProjects": "Mes projets",
    "myjourney": "Mon parcours",
    "myjourney1": "Après un <strong>BTS SIO</strong>, j’ai obtenu en 2019 une <strong>licence professionnelle</strong> en “Développement d’applications Web et Big Data” à Limoges. Cette dernière année s’est déroulée en <strong>alternance</strong> chez Emakina, une agence web également basée à Limoges, qui m’a offert l’opportunité de m’essayer au développement front-end, malgré une formation initialement orientée back-end.",
    "myjourney2": "Ce défi a été une révélation : j’ai rapidement pris mes marques, ce qui m’a permis de poursuivre l’aventure chez Emakina en tant que développeur front-end pendant <strong>cinq ans</strong>. Durant cette période, j’ai travaillé sur une grande variété de projets, sites <strong>vitrines comme e-commerces</strong>, que je détaille sur la <a href='./projets.html' data-i18n-title='my-projects' title='Mes projets'>page dédiée à mes réalisations</a>. J’ai évolué au sein <strong>d’équipes agiles</strong>, avec une exigence constante de qualité technique et visuelle.",
    "mygoals": "Mes objectifs",
    "mygoals1": "Actuellement basé près de Bordeaux, je suis <strong>disponible immédiatement</strong> pour un poste en Nouvelle-Aquitaine ou en Occitanie. Je peux m’adapter rapidement à une nouvelle opportunité.",
    "mygoals2": "Je souhaite aujourd’hui rejoindre une équipe où je pourrai continuer à évoluer dans le développement front-end tout en renforçant mes compétences, notamment sur les frameworks JavaScript comme Vue.js ou React.",
    "mygoals3": "Je suis également très curieux des nouvelles pratiques liées à <strong>l’intelligence artificielle</strong>, que je considère comme un <strong>atout majeur</strong> pour notre métier, aussi bien pour améliorer notre productivité que pour explorer de nouvelles façons de concevoir et développer des projets. Ce que je recherche avant tout, c’est un <strong>environnement stimulant</strong>, où je pourrai apprendre, échanger, et contribuer à des projets concrets et variés.",
    "contactTitle": "Portfolio Thomas Crouvizier | Contact",
    "contactTitleH": "Me contacter",
    "contactTitleLink": "Me contacter par mail",
    "linkedinLink": "Accéder au profil LinkedIn",
    "contactMail": "Pour me contacter par e-mail :",
    "contactOthers": "Autres moyens :",
    "dlCvTitle": "Télécharger mon CV :",
    "dlCvTitleLink": "Télécharger mon CV",
    "dlCvButton": "📄 Télécharger mon CV",
    "skillsTitle": "Portfolio Thomas Crouvizier | Compétences",
    "skillsTitleH": "Mes compétences",
    "skillsEntry1": "Compétences techniques",
    "skillsEntry2": "CMS pratiqué",
    "skillsEntry3": "Savoir-être",
    "skillsEntry4": "Gestion de projet",
    "skillsAbilityPerso1": "Communication",
    "skillsAbilityPerso2": "Autonomie",
    "skillsAbilityPerso3": "Esprit d’équipe",
    "skillsAbilityPerso4": "Adaptabilité",
    "skillsAbilityPerso5": "Approche logique",
    "skillsAbilityPerso6": "Organisation",
    "skillsAbilityProject1": "Agile / Scrum",
    "skillsAbilityProject2": "Gestion de tâches avec Jira",
    "skillsAbilityProject3": "Suivi de délais et de priorités",
    "skillsAbilityProject4": "Expérience utilisateur",
    "skillsAbilityProject5": "Documentation technique",
    "projectsTitle": "Portfolio Thomas Crouvizier | Projets",
    "projectsTitleH": "Projets de build",
    "projectsTitleH2": "Interaction de support",
    "followLink": "Voir le site",
    "close": "Fermer",
    "knowMore": "En savoir plus",
    "followLinkArchiv": "Voir la version archivée",
    "projectsDescampsDetail": "Détails du projet Descamps",
    "projectsDescampsPeople": "Équipe : 3 backs, 3 fronts",
    "projectsDescampsTime": "Durée : 5 mois",
    "projectsDescampsActivity": "Travaux réalisés : Divers blocs de contenu, template de mail, administration back-office",
    "projectsDescamps1": "Il s’agit du premier projet sur lequel j’ai été intégré en arrivant dans l’entreprise pour mon alternance. Il m’a permis de prendre en main le développement front-end à travers la réalisation de petites tâches variées, ainsi qu’une initiation à la création de templates d’e-mails.",
    "projectsDescamps2": "Un défi m’avait été fixé : atteindre un niveau suffisant en front-end avant la fin du projet (environ 4 mois) pour pouvoir être affecté à d’autres projets en tant que développeur front. Dans le cas contraire, je devais retourner au back-end, comme initialement prévu. Ce défi a été relevé avec succès.",
    "projectsDescamps3": "Ce projet a également été l’occasion de découvrir le fonctionnement interne de l’entreprise : méthodes agiles avec Jira, gestion du versioning avec Git, préparation et participation aux démonstrations client.",
    "projectsDescampsLink": "Lien vers le site Descamps",
    "projectsAgnesbDetail": "Détails du projet Agnes. B",
    "projectsAgnesbPeople": "Équipe : 2 backs, 4 fronts",
    "projectsAgnesbTime": "Durée : 5 mois",
    "projectsAgnesbActivity": "Travaux réalisés : Divers blocs de contenu, PLP, PDP, template de mail, administration back-office",
    "projectsAgnesb1": "Ce deuxième projet m’a permis de monter en compétence avec des tâches plus complexes, comme la mise en place des cartouches sur les pages listing produits (PLP) ou encore la réalisation des pages produit détaillé (PDP). J’y ai approfondi mes connaissances en développement front-end, tout en découvrant et en me familiarisant avec le CMS Proximis.",
    "projectsAgnesb2": "C’est un projet qui m’a accompagné sur le long terme : après la phase de développement initiale, nous avons continué à en assurer la maintenance. J’ai donc régulièrement réalisé des modifications ponctuelles dessus au fil des années.",
    "projectsAgnesbLink": "Lien vers le site d'Agnes.B",
    "projectsDugasDetail": "Détails du projet dugasclubexpert",
    "projectsDugasPeople": "Équipe : 3 backs, 3 fronts",
    "projectsDugasTime": "Durée : 6 mois",
    "projectsDugasActivity": "Travaux réalisés : Divers blocs de contenu, footer, header, PDP, PLP sélectives, administration back-office",
    "projectsDugas1": "Ce dernier projet de mon alternance s’inscrivait dans la continuité du projet précédent (Agnès b.), avec une différence importante : j’étais cette fois pleinement considéré comme un développeur front-end à part entière, et non plus comme un assistant.",
    "projectsDugas2": "J’ai bénéficié de davantage de liberté et d’autonomie, ce qui m’a permis d’apporter mes idées, notamment sur certains choix liés à l’expérience utilisateur. J’ai également pu avoir un impact plus direct dans les échanges avec le client.",
    "projectsDugas3": "Malheureusement, pour des raisons inconnues, le site a été clôturé en début d’année. J’ai toutefois mis à disposition une archive de la version en ligne de l’an dernier, afin de pouvoir en montrer un aperçu.",
    "projectsDugasLink": "Lien vers le site de dugasclubexpert",
    "projectsAurepDetail": "Détails du projet Aurep",
    "projectsAurepPeople": "Équipe : 3 backs, 2 fronts",
    "projectsAurepTime": "Durée : 3 mois",
    "projectsAurepActivity": "Travaux réalisés : Divers blocs de contenu, template d'article, administration back-office",
    "projectsAurep1": "Il s’agit de mon premier projet après la fin de mon alternance, réalisé avec Drupal. J’avais déjà eu l’occasion de travailler avec ce CMS auparavant, principalement sur des tâches de support sur divers projets, mais c’était la première fois que je participais à un projet dès son tout début.",
    "projectsAurep2": "J’ai notamment été impliqué dès l’étape de vérification des maquettes avec le designer, afin d’évaluer la faisabilité technique du projet. Il s’agissait d’un site purement informatif, sans fonctionnalité e-commerce, avec un budget plus restreint que ceux sur lesquels j’avais travaillé jusque-là. Cela en a fait une expérience différente, avec des besoins spécifiques et une approche de travail adaptée aux contraintes du projet.",
    "projectsAurepLink": "Lien vers le site Aurep",
    "projectsGuinotDetail": "Détails du projet Guinot",
    "projectsGuinotPeople": "Équipe : 2 backs, 3 fronts",
    "projectGuinotTime": "Durée : 7 mois",
    "projectsGuinotActivity": "Travaux réalisés : Divers blocs de contenu, slider produits, outil de recherche en géolocalisation, partie 'mon compte', administration back-office",
    "projectsGuinot1": "Ce projet a marqué ma première expérience avec Sylius au sein d’Emakina. J’étais ravi d’y être affecté, car c’était un véritable défi : aucun membre de l’équipe n’avait encore travaillé avec ce CMS, et nous avons donc dû tout apprendre au fur et à mesure du développement.",
    "projectsGuinot2": "En plus de Sylius, nous avons utilisé Contentful pour la gestion des pages, ce qui a représenté une autre nouveauté à assimiler. Le référent côté client étant un ancien développeur, cela a apporté une dynamique particulière : les échanges étaient plus fluides et techniques, ce qui a grandement facilité la collaboration.",
    "projectsGuinot3": "Pour ma part, en plus de diverses tâches comme l’intégration de listes de produits (notamment sur la page d’accueil) et de blocs de contenu, je me suis particulièrement investi sur la partie géolocalisation des instituts. Ce fut un véritable chantier pour moi, car je découvrais l’API Google Maps et devais gérer tous les besoins spécifiques du client sur cette fonctionnalité, qui était un élément clé du site.",
    "projectsGuinot4": "Le projet a été une réussite : près de trois ans après sa mise en ligne, le site est resté quasiment inchangé, preuve de sa solidité et de sa qualité.",
    "projectsGuinotLink": "Lien vers le site Guinot",
    "projectsKidsaroundDetail": "Détails du projet Kids Around",
    "projectsKidsaroundPeople": "Équipe : 3 backs, 2 fronts",
    "projectsKidsaroundTime": "Durée : 6 mois",
    "projectsKidsaroundActivity": "Travaux réalisés : Divers blocs de contenu, panier, menu header, footer, administration back-office",
    "projectsKidsaround1": "Ce dernier projet chez Emakina avait une particularité : il s’agissait d’un nouveau changement de CMS, avec l’utilisation de Salesforce. Au sein de l’équipe front-end, nous étions trois, mais j’étais le seul à qui l’on avait laissé quelques semaines pour m’auto-former en amont.",
    "projectsKidsaround2": "J’ai commencé par étudier la documentation et m’exercer sur une sandbox, puis j’ai renforcé ma maîtrise en assurant du support sur un autre projet basé sur Salesforce (le site Courir). Cette phase de formation m’a permis, par la suite, d’accompagner mes collègues et de leur transmettre mes connaissances sur Salesforce pendant toute la phase de développement.",
    "projectsKidsaround3": "Ce projet a été très enrichissant, car il m’a permis d’endosser un rôle de lead front-end, avec davantage de responsabilités et une vraie implication technique et humaine dans la réussite du projet.",
    "projectsKidsaroundLink": "Lien vers le site Kids Around",
    "projectsCamillacDetail": "Détails du projet Le tertre Camillac",
    "projectsCamillacPeople": "Équipe : seul",
    "projectsCamillacTime": "Durée : 2 jours",
    "projectsCamillacActivity": "Travaux réalisés : totalité du site et de l'administration back-office",
    "projectsCamillac1": "Projet réalisé en dehors d’Emakina, durant ma période de recherche d’emploi, pour un petit domaine viticole du Blayais. J’avais jusqu’alors très peu manipulé WordPress, uniquement lors de tests techniques passés en entretien.",
    "projectsCamillac2": "Il s’agissait donc de mon premier projet concret avec ce CMS. Bien que modeste, ce projet a été très formateur pour moi, et le résultat a pleinement satisfait le commanditaire. Une belle expérience, à la fois technique et humaine.",
    "projectsCamillacLink": "Lien vers le site le tertre camillac",
    "projectsNike1": "Ce projet interne à Nike, exclusivement développé pour un format mobile, a marqué mes premiers pas avec Vue.js. Même s’il ne s’agissait que de petites retouches ponctuelles, c’était une première prise en main très enrichissante.",
    "projectsNike2": "À l’époque, je n’avais aucune connaissance de Vue.js, mais ce projet m’a permis de découvrir un outil à la fois moderne et puissant, que j’ai appris à apprécier par la suite, même s’il était malheureusement peu utilisé chez Emakina.",
    "projectsNike3": "Étant donné qu’il s’agit d’un projet interne à Nike, je ne peux ni en partager de captures d’écran ni fournir de lien vers une version en ligne.",
    "projectsExpanscience1": "Ce fut l'un de mes premiers projets en support, qui m’a permis de me former à Drupal et de découvrir le fonctionnement du support technique. J’y ai réalisé diverses tâches, allant de la création de nouveaux blocs à la refonte de certains éléments, comme la page d’accueil.",
    "projectsExpanscience2": "Ce projet était déjà en phase de support avant mon arrivée, et il y est resté pendant toute la durée de mon engagement. Une expérience très formatrice, qui m’a donné un bon aperçu des enjeux et des exigences du support à long terme.",
    "projectsExpanscienceLink": "Lien vers le site expanscience",
    "projectsATPS1": "Ce projet était initialement géré par un développeur back-end à Emakina, qui avait quelques connaissances en front-end, mais faisait souvent appel à moi pour les tâches plus complexes en front. J’ai notamment participé à la refonte de la page d’accueil.",
    "projectsATPS2": "Le projet utilisait Angular, ce qui m’a permis de poser mes premières bases avec ce framework. J’ai pu avancer dans cette découverte grâce au soutien de mon collègue, qui avait déjà de l’expérience avec Angular.",
    "projectsATPSLink": "Lien vers le site ATPS",
    "projectsCourir1": "Sur ce projet, j’ai d’abord apporté mon soutien à l’équipe en place, tant pour aider que pour m’auto-former, avant de passer sur un autre projet où j’étais le seul front-end formé sur Salesforce, avec la mission de partager mes connaissances avec l’équipe.",
    "projectsCourir2": "Sur Courir, mes tâches ont été principalement axées sur le support technique, en particulier la manipulation du back-office, ainsi que quelques petites tâches front-end, ce qui m’a permis de me familiariser avec la hiérarchie des dossiers et les spécificités de ce type de projet.",
    "projectsCourirLink": "Lien vers le site Courir",
    "projectsOrange1": "Ce projet de support a été l'un de ceux qui m'a pris le plus de temps, car les clients étaient très actifs, mais souvent peu formés à la gestion de leur site. De nombreuses demandes concernaient des tâches simples qu'ils auraient pu réaliser eux-mêmes.",
    "projectsOrange2": "J’ai donc pris l’initiative de former les clients en leur montrant comment effectuer ces modifications. J’ai réalisé les tâches en partage d'écran avec eux et fourni une documentation détaillée, afin qu'ils puissent, à l'avenir, effectuer ces changements de manière autonome.",
    "projectsOrangeLink": "Lien vers le site orange réseau",
    "footerCreateBy": "Créé par Thomas Crouvizier"
}
